app/controllers/products_controller.rb

INSERT INTO "products" ("title", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Socks"], ["price", 50.0], ["created_at", "2023-02-24 12:27:36.730749"], ["updated_at", "2023-02-24 12:27:36.730749"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Sunglasses"], ["price", 18.0], ["updated_at", "2023-02-23 17:14:45.212059"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 8]]
---
  def destroy
    @product.destroy